#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "80d40f6b2398afa2e3a08bc5538c94d8" -> "673e77933f65fa08f4713327dd605e4a"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6e90484feda1888f31c71642c1e04d75" -> "c9805d486f03418a2ea09f096e534fe5"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "c1a453262c15c1282ef3810ccaf67c84" -> "7e8ad2d8780ff14ebcfdede86c6f052a"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "2d7f1d1dd7ee4a150357773337bb920d" -> "c2c3024ebd1a98f3702695b45d1e747c"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "de8bf7ac1853499917e738ce032dc16c" -> "c4473a7ea6ebb1a0809e99d706ec6ca2"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "0501ccafe58809bcbbd694b3e9dafbdb" -> "596d2e9af19fd847817139055a9dfc08"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "62d13e86aa235fb0b4d9bb22d517758b" -> "b0d192a54c224114be41838c85c5cbbb"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "fa8d5328596c44e77ed0e669913b0122" -> "033d869f81457365252be7ffd3bdadc6"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "2f6f35b6e706e1110ef411669af7547a" -> "efc45d160cfe33b08da4cc17eaf863e8"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "09cae3e624c88f148a53f9bf83d85f49" -> "f5918d5d49cc0b2bfc6771b6af1e8e56"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c800b7c4cb853e43c5ff571c012a8d3d" -> "1d5ef57eeb052c3473e8e0b09c6aa52c"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "328f816783e1dbec4921714e72d4f4d7" -> "66574167c7119cdfa7fe453d962670ff"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a5078d9af7a729e6adf3ff86350cf725" -> "bfa712fcfb402b9e6d5bd7d78e2f8927"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "cfa7530a1aa6edeb37e7cf836826735d" -> "cb97029c4f0ff97e9f09377fde79419b"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "5ac73b560537c336d9e5ab8d0c720305" -> "7442bf38abbb56f0d606c6e8d4ccd153"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c7664b881ef5eb02aedf7e94d54338b5" -> "afc858a266cec07b00b27dc7191aa739"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "627b50f767548b59d865cfb162cdf664" -> "8ecbe2af88b9472e1b0947e7d9be0651"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f12f668ab03d7f1887f0c32341d03fa5" -> "e1556634071f63c78e22bf701ce84afd"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "df20c594c5ba3878cb289f2092b97dc6" -> "f730a8d027f770e259dc90edbe651791"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "96471538b0e23956571e02d8160b7382" -> "2ef57d2edcaac02e9ff0efd6fc4601e1"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "b7e48c468b7e5ef36d2a0d60635cbcbe" -> "8762908a6b8b1ba5c78cbe6d1e1dcdeb"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8908960f88ce40fcdb1ffec207cbb0ad" -> "3e5f35b2c2f7a35e030007e25439b910"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "94fe860ded3d3997eb8ca3763101a655" -> "52c85ed9d0e2c9a5c7ba550d169952b9"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "14acccac546748ee53c111f69329164f" -> "49e7ef03899e246a165d8ecee555cdb4"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "6b70f32f3c1f118b6f00883494bde79f" -> "a3c81493eb1c0c12e6111917739c922d"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "97a04186891c2841735416717409e486" -> "4cc4dc7f89a29359be926bff15564033"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "0a99aed4951ece5edf351a8736994b53" -> "935a16925805991bd77770161f96270c"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "262275cbf1357627b34f965aaeebeb7b" -> "e68eeb7cdd35fa8a3cb15afdd6c90efb"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "974e6bf3ca6b64326678ab1b6cbff75f" -> "79ad3c7d609303eadfd8e74c5c2fa4e6"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "6b686393d1d59e43afce68795ddec703" -> "05758190e151a4a7405cc97f8c309ece"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "969325bac554ef69f88d232a4896071d" -> "537874a8393e8ce4eba1ab8d3c9b6e60"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "6c435f4ee958e551ad441ed96462152a" -> "e4b758f608a7849571ff5877d0341dfd"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d120accceafbbf432b14c21f454c9e1d" -> "52fdc14bd51165a6744fb49d17ef09c0"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "db361e87a2bfefe0588871f4acb435d6" -> "f4c0042037b72b2908797a57b1e263d6"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "969942d72977fa2062d81387362469a7" -> "ba777fd5447ed8960b360abe4f28541e"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "fed4842405a1fc530b169c7f1d33ba96" -> "2939c0b3596f24ff295788957e64247d"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "2a5e1e2991f0221dd62e0a10acb40eaf" -> "9f6db8cbd8abc49b5adb44c0bb234e12"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8d420a74277c014252865a8753f1eb9" -> "412d3d85cc23e27e523e70f2d9042778"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be created
  + resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "759957d35bf908836bdda9554ebbd4c1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/modify_ranges_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/modify_ranges_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "c859bcc45e73cb5ff16cfe041f16c426" -> "109df3e38662be46eb36f77b97ab1ad3"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "f4f4e3ec69473e3ed30bcf619ec11644" -> "04e1d620a4890c0da7640055c04afc13"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "5573c37f3048302272bb101d10016aac" -> "f2256033f7e541a7674d283b3b50b54c"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "08e18a3a66a12fd91d00cd9d4a33b937" -> "27893e0756599d36f1f4449f3fb1330e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "01321b1e9b306a11503b214c19dce63f" -> "fd3f86b1a4eb9b964333cdf19747cf9e"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8b03e919e09f0ef9691a6420114c1823" -> "984e98fc5d0627d1df9576ff11812b85"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "pz3htoD0yNlo6x0SHrigBiBUo7gdUoxPY/Ku3K2Atbc=" -> "WDUAEvLCEJfAqtaAnbi5MOonhI+kmj9lTEJ9d85cc8I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFbf4lqphaxxooKg/ZhertyLxix14CspjtI9hI3fDQo=" -> "OJWkftzD2WI5fMyvUVsv8KaZywU8vVlEfAP7iPuH9a8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "SbNUI5QYL84E99oTrv26R2DSJnXJpzZu4AtD95fYuGE=" -> "mdMSLNXOizruMROFTsceYBgIyB3n1numfjFDvye/nMI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "FOk5rgRrWLFbS195sL1zgZsmlsGomSBZsC583ngQteQ=" -> "4xPqxKkFk8T6m7zcGgT8jgWILHA3wq8M1pQtqcdV1ow="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "7uWq7APVF/i42CJSxe4ZbAFEySLMX6szl7npcR8zYQg=" -> "YPJgj1BOU5XjDGlDoL9H2EUbSycDt4scDpareRaWdMU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "V8DJPePO2ysYdgJlvePikqKyT8bBqM6jEAeUq0Z35DU=" -> "WhQO5sQ2U8yaS4AswnVk5lEcGZW+MKbU73zXi7uysTQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "M0qv/E7aSFeRKn19Q81eAk1yr4/ugKD7hk1z2rFFp88=" -> "756aXOnZv7wUtG1pVNDJvQSpgRX7icHx0LR+aoIWIQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "gKNcksXN0wa8i/FXKkJ8FEyp9wCI/Tg3UwwsvobYWdM=" -> "tROOUtPayEFZFerCMEZ1PQunL5fLWFZqfIp//LnC39A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "72nnnjaxAOm3s5N6rweO0T8LVl9dYPyC8LRdpRXw+Ug=" -> "crffcHfUWc3UVi9eoq40nspvrUkZKxKyQ4DgPygokHA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cx3ej0kRI4s/vC172/kIgVXKpt52eo69+sgXAE0HRtQ=" -> "bs7rdkZCEQ7qPHVViV1Y1iSoc3gBlBkk69XNdLJnMmc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tq7tJtoO6oWppe0inIpIZ1vXDNtvtJ7BXHLzeOOnGJE=" -> "k4kLEJHvTyRxlgyXmkQhKYhFHP0RVExzRU296rEWbSU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "cjwN3AHZzZYnKc3oKP4EYLk9rgaOc7hmRXbjx07HrZk=" -> "LXeysfNEPUGtikv0rXCDUZSsJ/hWEaQsDZvMNfqKP68="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "gjaICGuKDu4YwCpm/taQjAkT30g32Xa4/ZnZrDrBRrA=" -> "IxlxViW6pD3LxkcrlYUt1/2LBDPxSYVRDSyZxtAuOEs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "EH9ONU4wEjTC65k4bkYg4xSo8VFBuDHlMC4OwWb2nuM=" -> "UYwv3XDdamXLHLYHX4ebUfAG7Cuf1gOuIv/6t+Mo3a0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "83gNft9CciqnCfkFirTLxVKC+jAzZ3/707gwQqGMpio=" -> "bVFe3odmn4ESLYyj5jupfolDYyoxi2r+462v9W7Gn4k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "u9wCH7HjzkFrgjZ3HTVqKcBkLqvJGbFJ2LNqbIBzKMs=" -> "+FBbH6XYzyYDeA5rhOMdFIFmtKCL0wvtJ7MXP3Q7XcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "HeA+IRwBQzOATdr3YG1G7RKYRG7J/HD2srDMAYplr8U=" -> "s0JjWDEnDXhLBXobLw22pTXxuzJWC73SnCjL1d8/Ko0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ztYVVIXBG0LCnk9bOKqqYWKuRaJLow/Jmz9KSOrYki4=" -> "LDmpXbehZ6RYzbqkrLvSsAD4e6aDVWyc0vBJX2ibySs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EkUpleTTnZK4EQQYUz5vBZygzmKp8W2/hqiLhP+tLDc=" -> "M8Z9kSVaGcGOkYFjvrxucCQ3gx0nz7inyPFD0ZhZx54="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "nlXDSgWSqKuoPdCBse9eMaj1t26p6lzXHWQwrRHCcNk=" -> "OpIQiOVszImA2lZ+e/nP79DKHPzgffaqcRyD6AB0E7c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "deIbtMjgQiefvsWkBApK/2afkVKPeK1UiBlJaN6aMcM=" -> "IxtO4rCtW7WcoV70YNcOXpIiC5XbVMhu1lugfwdsx2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "qjeeELthImR/KTjs/UzYiSBOWPyr652GErsebgN6AaU=" -> "t6KobijePDlEJnn4ooV6+2IvzYBPhT4GhgckuKb5z+w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "fBzD2YiadsPROd8U28Fxg5thT2qbxOrRo/Ureod2IWI=" -> "2av3DOHtKQCIKzTAK0TV9CnCjwmV6b2Xj2d5IjVQrm0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "AHcCUCTQBphwcSzRlmV+ShbE3UK/c+bia1mmmMZLqKU=" -> "vX8QVpMpbN9n9BJ7obaNWRCd8eoiVNUQ93lEG7lTNXw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DX5KKbPwZjRN36Iv2luKiNn8T7G3mslgQUCrVP3Ch9E=" -> "9nTpDWIK2fsHcnNltxfc412jrBlHhCXP0C9ukEdr9+c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "kfFSidhWh0eF/0CPXIj8YcjSlj1vsDEZiFq6EIyOxm8=" -> "kbMFD9tM4HM6czXiypVdyejihr6mtX979YYtprm/Djg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "La7Z4T5jatluSRSKnJymLur3BNaZnGAM4NcNB9lzjCM=" -> "tMmNMmE+yh4CeJLveM2yrcGuABuNLLaOE0GpsDrCKfQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "AvnP03wLKF4ZCXvJQcLOih6weaO0tmEAfAkFbKMvXnA=" -> "r4ahWtbvwaaBlArALZrUMhZgzrX6et9HN7o7RYk1yWc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "/a6m0Fg2e+yD+W2HMvt/KcP8sqnWdxeJ6+C1sfN8nB0=" -> "QbDG8wZilfBo6hY5TWK4LOaIbZePw2Uc81H4bB94sk4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPh+qbjepVjFqR/ms/QN5v/y+YIwTML7Kz639PMncI=" -> "kkznDAvYEesWr7czygZKIfeT0/p77r0iNGiK6oijP1k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry3D4SuqfJXyFQEBbDJikMTsc+iid968GTDE12Dym7o=" -> "9SlNM5yM/RsCOX+MnxJjyZiBwwhcwaU1BTpZLpgZjlo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "ayMrDZVaN2uri1daMpHUdNS/cKQMiyjGL8mTKEvXwmo=" -> "g5D4FboVdi4385CBTs5fAdC9nZX5OLAuw/6+kFGCnvw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+1qxqARajc3jpyh4hZfu5edrDafIkSmra8zSNaaPg8=" -> "evr+Ns4nTjijpEax6RnTt/2YoxklyZ4Cji3RjIVGBYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "pywKnu6y00eoREjkmVxmN1AUqAxp9FpWq9SfPVlqSUE=" -> "ySgeWoqcZuY6mHkf29Qg1cyBe8p3qmqI94CWVh10QdY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "u65H4hUOS+Fs5subesztK0fmevWmicwYirYTAZSGySA=" -> "95n6xhKbPAuQywGGDe5JRJyOhCG9KE7BwwLT5r4PvD0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "SdA9ZoqQxAWMRFhnd+cxv594QkuF2QTc9QzDMghe3cs=" -> "NkLlo+s15VPrG57Oex7gf2QR+urMq0mwkw4sSbiGwWY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "3lND2H6LF16D8D1jM7DbuH+eAuGgF186ClfBfEvXWLY=" -> "EoRPMl2XlH6XazfPfKYsLRUBA6zTuSxHU2jtjpO688A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be created
  + resource "aws_lambda_function" "modify_ranges_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_modify_ranges_lambda_function"
      + handler                        = "modify_ranges_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/modify_ranges_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "6fyb9AGHpibbN1Nmkk2fte1XOkR5gC03+svSUo8DdKA="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "glz/flXmItcDZ7p8Oqo/MEAxP88dFD3I59MeC3/fjUY=" -> "6959rXLOdIh5kso0msWIixBMWWW5aPrI06JXzS4ZhOY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "9DF5NccVpymq830SRBsYeaLKbPk/k5vHlc97UfMnzuU=" -> "d9jzMSLkyj9vtYIlVYobD6oM/3uNzl43rzjP1mPbX7k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "Wygx505fhv8BSn+Vfuk1r+6bbLB3DVnW5J84+VV1Xzw=" -> "2jMiyyJs8cHsKycfj7lZW8vCPlS7gqyzoq1WcYpvxp0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "wOO+YHgAF5dRu2QJwZ99289sLJ+lIqCX7DaY3GNSeWc=" -> "EwxcA5g0vBXbaiEkBgmY7RmHrKeI7H+WA6SwruipgI0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-08T22:46:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "C5tjjrynkpihF2ulYNusG6ZoAVt37Y5oXZWL0gAzlk8=" -> "6s4deIktczT21kbFKNbPrIeg+yDqK+RwC7AP+k06u3w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-08T22:47:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "EGvlWfq0aPsTOzU4plwNBuz4cNwrCFgLTULB7ju3HHU=" -> "e06ceA27lPw2TYWQJ7N/hnx5qiOj57YzZBwaBudLzfE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-08T22:46:33Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "v9bqr6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.modify_ranges_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "modify_ranges_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_modify_ranges_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.modify_ranges_integration will be created
  + resource "aws_api_gateway_integration" "modify_ranges_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "xqe34y"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.modify_ranges_method will be created
  + resource "aws_api_gateway_method" "modify_ranges_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = "xqe34y"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-08T22:46:31Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.modify_ranges_lambda_exec_role will be created
  + resource "aws_iam_role" "modify_ranges_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_modify_ranges_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.modify_ranges_cognito_policy will be created
  + resource "aws_iam_role_policy" "modify_ranges_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_modify_ranges_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.modify_ranges_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "modify_ranges_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_modify_ranges_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_modify_ranges_lambda will be created
  + resource "aws_lambda_permission" "apigw_modify_ranges_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_modify_ranges_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 11 to add, 89 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*